Repository: b-jesch/service.lgtv.remote
Catalog: resources/language/*/strings.po
Languages: german

# Addon Summary
source: LG Smart TV 3D Switch - for both 2011 and 2012 series
german: LG Smart TV 3D Switch - für die 2011er und 2012er Serie

# Addon Description
source: This addon turns your LG Smart TV into 3D mode automatically over the network if a tagged '3D' content is playing. For this, the TV device must be integrated in your home network properly. This addon supports the old 2011 series and the newer 2012 series too.
german: Dieses Addon schaltet Dein LG Smart TV-Gerät über das Netzwerk in den 3D-Modus, sobald ein als '3D' markierter Inhalt abgespielt wird. Der LG Smart TV muss dazu korrekt in das Heimnetzwerk eingebunden sein. Es werden sowohl die Modelle bis 2011 als auch die nachfolgenden 2012er unterstützt.

# Addon Disclaimer
source: Use at your own risk. Don't use unknown code sequences!
german: Benutzung auf eigene Gefahr. Keine unbekannten Code-Sequenzen verwenden!

# #30010
source: IP of LG Smart Device
german: IP des LG Smart TV Gerätes

# #30011
source: Communication Port
german: Port

# #30012
source: Communication Protocol
german: Protokoll

# #30013
source: Pairing Key
german: Pairing Schlüssel

# #30014
source: Scan Network for LG Smart TV Device...
german: LG Smart TV Gerät im Netzwerk suchen...

# #30017
source: auto detect
german: automatische Suche

# #30018
source: extended Settings
german: Erweiterte Einstellungen

# #30019
source: Key Code Sequence Delay
german: Tastencode Verzögerung

# #30020
source: Use own Key Code Sequences
german: Eigene Tastencodes verwenden

# #30021
source: Key Code sequence 3D on
german: Code Sequenz 3D ein

# #30022
source: Key Code sequence 3D off
german: Code Sequenz 3D aus

# #30030
source: Type in pairing key of TV device
german: Pairing Schlüssel des TV Gerätes eingeben

# #30031
source: Pairing with LG Smart TV on IP %s and %s successful. To activate pairing, Kodi must be restarted. Would you like to restart Kodi now?
german: LG Smart TV auf IP %s über %s erfolgreich gepairt. Um das Pairing zu aktivieren, muss Kodi neu gestartet werden. Möchtest Du Kodi jetzt neu starten?

# #30032
source: Session not established. Possibly Kodi must be restarted.
german: Es konnte keine Session zum Smart TV aufgebaut werden. Eventuell muss Kodi neu gestartet werden.

# #30050
source: There wasn't found any LG Smart Devices on your network. Be sure your devices are turned on or enter IP of LG Smart TV manually.
german: Kein LG Smart TV Gerät im Netzwerk gefunden. Überprüfe, ob dieses eingeschalten ist, starte den Scan erneut oder gebe die IP Deines Gerätes ein.

# #30051
source: There seems to be an issue with the used device protocol. Device can't be paired.
german: Das Gerät kann nicht gepairt werden, da ein Problem mit dem verwendeten Protokoll aufgetreten ist.

# #30052
source: Protocol types 'ROAP' and 'HDCP' are not accepted by your device. Can't pair.
german: Die Protokolle 'ROAP' und 'HDCP' werden nicht von Deinem Gerät unterstützt. Ein Pairing ist nicht möglich.

# #30053
source: No connection to IP address %s. Turn on your LG Smart TV or check your settings.
german: Keine Verbindung zur IP-Adresse %s. Schalte Dein LG Smart TV ein und/oder überprüfe Deine Einstellungen.

# #30054
source: No connection to LG smart TV
german: Keine Verbindung zum LG smart TV

# #30055
source: This Addon is a part of LG Remote 3D Switch Service and cannot use as a standalone application.
german: Dieses Addon ist Bestandteil des LG Remote 3D Switch Services und kann nicht als eigenständige Applikation aufgerufen werden.
